export const tariffs = [
    {
        id: 0,
        name: "Тариф 1",
        publicationPrice: 400,
        royalty: 0.5,
        color: "green",
        conditions: [
            "Доход с каждой купленной книги сразу вам на карту \n",
            "Постоянная поддержка связи с автором \n",
            "Запрет на скриншоты текста книги ",
        ]
    },
    {
        id: 1,
        name: "Тариф 2",
        publicationPrice: 500,
        royalty: 0.4,
        color: "lil",
        conditions: [
            "Доход с каждой купленной книги сразу вам на карту2",
            "Постоянная поддержка связи с автором",
            "Запрет на скриншоты текста книги",
        ]
    },
    {
        id: 2,
        name: "Тариф 3",
        publicationPrice: 600,
        royalty: 0.3,
        color: "accent",
        conditions: [
            "Доход с каждой купленной книги сразу вам на карту3",
            "Постоянная поддержка связи с автором",
            "Запрет на скриншоты текста книги",
        ]
    },
]