import React from 'react';
import s from './PrivacyPolicy.module.css';

const PrivacyPolicy:React.FC = () => {
    return (
        <div className={s.privacypolicy}>
            <h2 className="header_center">Политика конфиденциальности StorySphere.ru</h2>

            <h2>1. Введение</h2>
            <p>
                Настоящая Политика конфиденциальности (далее — «Политика») регулирует обработку персональных данных
                пользователей интернет-сайта StorySphere.ru (далее — «Сайт»), осуществляемую ООО «StorySphere» (далее —
                «Компания»). Компания придает важное значение защите персональных данных и соблюдению законодательства
                Российской Федерации в области обработки персональных данных.
            </p>
            <br/>
            <h2>2. Персональные данные, подлежащие обработке</h2>

            <h3>2.1. Обрабатываемые данные</h3>
            <p>
                В рамках использования Сайта Компания может осуществлять обработку следующих категорий персональных
                данных пользователей:
            </p>
            <ul>
                <li><strong>Идентификационные данные</strong>: фамилия, имя, отчество.</li>
                <li><strong>Контактные данные</strong>: адрес электронной почты, номер телефона.</li>
                <li><strong>Платежные данные</strong>: информация о транзакциях, история покупок.</li>
                <li><strong>Технические данные</strong>: IP-адрес, файлы cookie, данные о браузере и устройстве
                    пользователя.
                </li>
                <li><strong>Данные об использовании Сайта</strong>: история просмотров, предпочтения, данные о
                    взаимодействии с Сайтом.
                </li>
            </ul>
            <br/>

            <h3>2.2. Способы сбора данных</h3>
            <p>
                Персональные данные могут быть получены непосредственно от пользователя при регистрации на Сайте,
                совершении покупок, подписке на рассылки, а также автоматически при использовании Сайта.
            </p>

            <br/>
            <h2>3. Цели обработки персональных данных</h2>
            <p>
                Компания осуществляет обработку персональных данных в следующих целях:
            </p>
            <ul>
                <li><strong>Предоставление услуг</strong>: регистрация и ведение учетной записи пользователя, выполнение
                    заказов, предоставление рекомендаций и персонализированных предложений.
                </li>
                <li><strong>Связь с пользователем</strong>: направление информационных сообщений, ответ на запросы
                    пользователей.
                </li>
                <li><strong>Обеспечение безопасности</strong>: предотвращение мошенничества, обеспечение безопасности
                    данных пользователей.
                </li>
                <li><strong>Анализ и улучшение Сайта</strong>: проведение статистических и маркетинговых исследований,
                    анализ поведения пользователей для улучшения функциональности Сайта.
                </li>
            </ul>

            <br/>
            <h2>4. Основания для обработки персональных данных</h2>
            <p>
                Обработка персональных данных осуществляется на следующих законных основаниях:
            </p>
            <ul>
                <li>Согласие субъекта персональных данных на обработку его персональных данных.</li>
                <li>Заключение и исполнение договора, стороной которого является субъект персональных данных.</li>
                <li>Соблюдение требований законодательства Российской Федерации.</li>
                <li>Осуществление прав и законных интересов Компании или третьих лиц, при условии, что такие действия не
                    нарушают права и свободы субъекта персональных данных.
                </li>
            </ul>

            <br/>
            <h2>5. Передача персональных данных третьим лицам</h2>
            <p>
                Компания вправе передавать персональные данные пользователей третьим лицам в следующих случаях:
            </p>
            <ul>
                <li><strong>Исполнение обязательств перед пользователями</strong>: в целях выполнения заказов и
                    предоставления услуг.
                </li>
                <li><strong>Исполнение требований законодательства</strong>: по запросу уполномоченных государственных
                    органов в случаях, предусмотренных законодательством Российской Федерации.
                </li>
                <li><strong>Использование сторонних сервисов</strong>: привлечение подрядчиков и поставщиков услуг для
                    выполнения задач, связанных с функционированием Сайта, при условии соблюдения ими конфиденциальности
                    и безопасности персональных данных.
                </li>
            </ul>

            <br/>
            <h2>6. Сроки обработки и хранения персональных данных</h2>
            <p>
                Персональные данные обрабатываются и хранятся в течение срока, необходимого для достижения целей их
                обработки, либо в течение срока, предусмотренного законодательством Российской Федерации. По достижении
                целей обработки или истечении установленных сроков данные подлежат удалению или обезличиванию.
            </p>

            <br/>
            <h2>7. Права пользователей</h2>
            <p>
                Пользователи имеют право на:
            </p>
            <ul>
                <li><strong>Доступ к своим персональным данным</strong>: получение информации о факте обработки, целях,
                    категориях обрабатываемых данных, сроках хранения.
                </li>
                <li><strong>Исправление персональных данных</strong>: требование об изменении неточных или устаревших
                    данных.
                </li>
                <li><strong>Удаление персональных данных</strong>: право на «забвение» в случае, если данные больше не
                    требуются для целей их обработки.
                </li>
                <li><strong>Ограничение обработки</strong>: право ограничить обработку данных в определенных случаях.
                </li>
                <li><strong>Отзыв согласия</strong>: право на отзыв ранее предоставленного согласия на обработку данных.
                </li>
                <li><strong>Возражение против обработки данных</strong>: право возражать против обработки данных на
                    основании законных интересов Компании.
                </li>
            </ul>

            <br/>
            <h2>8. Защита персональных данных</h2>
            <p>
                Компания принимает все необходимые организационные и технические меры для защиты персональных данных
                пользователей от несанкционированного доступа, изменения, раскрытия или уничтожения. В числе таких мер —
                использование современных методов шифрования, организация внутреннего контроля и аудита.
            </p>

            <br/>
            <h2>9. Политика в отношении детей</h2>
            <p>
                Сайт и услуги Компании не предназначены для использования лицами, не достигшими возраста 16 лет.
                Компания сознательно не собирает персональные данные несовершеннолетних. В случае получения информации о
                сборе таких данных они будут немедленно удалены.
            </p>

            <br/>
            <h2>10. Изменения в Политике конфиденциальности</h2>
            <p>
                Компания оставляет за собой право вносить изменения в настоящую Политику. Обновленная версия Политики
                вступает в силу с момента ее публикации на Сайте. Пользователям рекомендуется регулярно проверять
                настоящую Политику на предмет изменений.
            </p>

            <br/>
            <h2>11. Контактная информация</h2>
            <p>
                По всем вопросам, связанным с настоящей Политикой, обработкой персональных данных, а также для
                реализации своих прав, пользователи могут обращаться по следующим контактам:
            </p>
            <ul>
                <li><strong>Электронная почта</strong>: <a href="mailto:info@storysphere.ru">info@storysphere.ru</a>
                </li>
                <li><strong>Почтовый адрес</strong>: 123456, г. Москва, ул. Авиамоторная, 8А, кабинет 209</li>
            </ul>
            <p>Дата последнего обновления: 23.08.2024</p>
            <br/>
        </div>
    );
};

export default PrivacyPolicy;